# Створити програму - гру "Поле чудес".
# Зареєструватись на github, та створити окремий репозиторій для цього завдання
# 1. Програма буде брати зі списку слів одне рандомне слово.
# 2. Програма буде отримувати від користувача число - кількість спроб вгадати
# 3. Далі програма буде чекати від користувача або букву, або ціле слово.
# 4. Якщо користувач пише слово, програма повинна перевіряти чи це не те саме число, якщо так то говорити що користувач вгадав слово, або писати що слово не правильне.
# 5. Якщо користувач ввів літеру, програма повинна перевірити чи є ця літера у нашому слові, та якщо є, виводити наше слово, де зірочками будуть закриті всі літери, які користувач ще не вгадав, або "Такої літери немає"
# 6. Якщо кількість спроб закінчиться, потрібно сказати користувачю, що він програв та закінчити роботу програми.
# 7. Спроби які являється вірними не мають враховуватись в лічильнику
#
# Приклад: Програмою обрано слово "apple"
# Input:10  #(10 спроб вгадати слово)
# Input:"a"
# Output:"a****"
# Input:"d"
# Output:"Такої літери немає"
# Input:"l"
# Output:"a**l*"
# Input:"e"
# Output:"a**le"
# Input:"p"
# Output:"apple"
# Output:"Вітаю, ви вгадали слово"

